In [1]:
"""
https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html
"""

# pandas
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
# 数据结构
# 基本原则：数据对齐是内在的

# Series
series_data = [1, 2, 3, 4]
se = pd.Series(series_data)
print(se.shape, se.index, se.keys())
print(se)

(4,) RangeIndex(start=0, stop=4, step=1) RangeIndex(start=0, stop=4, step=1)
0    1
1    2
2    3
3    4
dtype: int64

In [3]:
data = np.random.random((5, 5))
data_df = DataFrame(data)
print('*'* 20, 'head', '*'* 20)
print(data_df.head())
print('*'* 20, 'tail', '*'* 20)
print(data_df.tail(3))
print('*'* 20, 'describe', '*'* 20)
print(data_df.describe())
print('*'* 20, 'sort by axis', '*'* 20)
print(data_df.sort_index(axis=1, ascending=False))

******************** head ********************
          0         1         2         3         4
0  0.850338  0.827350  0.761072  0.172138  0.154913
1  0.210793  0.194477  0.851307  0.978129  0.093404
2  0.786064  0.660980  0.126670  0.420458  0.061129
3  0.562560  0.691917  0.039514  0.725394  0.829249
4  0.670200  0.555227  0.986620  0.494989  0.323637
******************** tail ********************
          0         1         2         3         4
2  0.786064  0.660980  0.126670  0.420458  0.061129
3  0.562560  0.691917  0.039514  0.725394  0.829249
4  0.670200  0.555227  0.986620  0.494989  0.323637
******************** describe ********************
              0         1         2         3         4
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.615991  0.585990  0.553037  0.558222  0.292466
std    0.251904  0.239441  0.437531  0.306719  0.316690
min    0.210793  0.194477  0.039514  0.172138  0.061129
25%    0.562560  0.555227  0.126670  0.420458  0.093404
50%    0.670200  0.660980  0.761072  0.494989  0.154913
75%    0.786064  0.691917  0.851307  0.725394  0.323637
max    0.850338  0.827350  0.986620  0.978129  0.829249
******************** sort by axis ********************
          4         3         2         1         0
0  0.154913  0.172138  0.761072  0.827350  0.850338
1  0.093404  0.978129  0.851307  0.194477  0.210793
2  0.061129  0.420458  0.126670  0.660980  0.786064
3  0.829249  0.725394  0.039514  0.691917  0.562560
4  0.323637  0.494989  0.986620  0.555227  0.670200

In [4]:
print('*'* 20, 'sort by axis', '*'* 20)
print(data_df.sort_values(by=1, ascending=False, axis=1))

******************** sort by axis ********************
          3         2         0         1         4
0  0.172138  0.761072  0.850338  0.827350  0.154913
1  0.978129  0.851307  0.210793  0.194477  0.093404
2  0.420458  0.126670  0.786064  0.660980  0.061129
3  0.725394  0.039514  0.562560  0.691917  0.829249
4  0.494989  0.986620  0.670200  0.555227  0.323637

In [5]:
# select
# 方法：.at .iat .loc .iloc


# 选择列 
# 方法：df['col'] 等价于df.col
data_df = data_df.rename(columns={1: 'B'})
print(data_df['B'])
print(data_df.B)

0    0.827350
1    0.194477
2    0.660980
3    0.691917
4    0.555227
Name: B, dtype: float64
0    0.827350
1    0.194477
2    0.660980
3    0.691917
4    0.555227
Name: B, dtype: float64

In [6]:
# [] 切片行
data[0:2]

array([[0.85033818, 0.8273504 , 0.76107167, 0.1721379 , 0.15491268],
       [0.21079329, 0.19447721, 0.85130732, 0.97812869, 0.09340369]])

In [7]:
# 按标签选择

# 选取一行数据
data_df.loc[0]

0    0.850338
B    0.827350
2    0.761072
3    0.172138
4    0.154913
Name: 0, dtype: float64

In [8]:
# 用标签选取多列
data_df.loc[:, ['B', 2]]

          B         2
0  0.827350  0.761072
1  0.194477  0.851307
2  0.660980  0.126670
3  0.691917  0.039514
4  0.555227  0.986620

In [9]:
data_df.loc[0, 'B']

0.8273503989195746

In [10]:
# 按位置选择
# 正数位置
data_df.iloc[1]

0    0.210793
B    0.194477
2    0.851307
3    0.978129
4    0.093404
Name: 1, dtype: float64

In [11]:
# 整数切片
data_df.iloc[3:4, 0:2]

         0         B
3  0.56256  0.691917

In [12]:
# 显示列切片
data_df.iloc[:, 2:3]

          2
0  0.761072
1  0.851307
2  0.126670
3  0.039514
4  0.986620

In [13]:
# 显示提取值
data_df.iloc[1, 1]

0.19447720641159294

In [14]:
# 快速访问标量，与上述方法等效
data_df.iat[1, 1]

0.19447720641159294

In [15]:
# 布尔索引
# 单列值选择
data_df[data_df.B>0.2]

          0         B         2         3         4
0  0.850338  0.827350  0.761072  0.172138  0.154913
2  0.786064  0.660980  0.126670  0.420458  0.061129
3  0.562560  0.691917  0.039514  0.725394  0.829249
4  0.670200  0.555227  0.986620  0.494989  0.323637

In [16]:
# 选择整个df中满足条件的值
data_df[data_df > 0.5]

          0         B         2         3         4
0  0.850338  0.827350  0.761072       NaN       NaN
1       NaN       NaN  0.851307  0.978129       NaN
2  0.786064  0.660980       NaN       NaN       NaN
3  0.562560  0.691917       NaN  0.725394  0.829249
4  0.670200  0.555227  0.986620       NaN       NaN

In [17]:
# 用isin()筛选
df2 = data_df.copy()
df2['E'] = ['one', 'two', 'three', 'four', 'five']
df2

          0         B         2         3         4      E
0  0.850338  0.827350  0.761072  0.172138  0.154913    one
1  0.210793  0.194477  0.851307  0.978129  0.093404    two
2  0.786064  0.660980  0.126670  0.420458  0.061129  three
3  0.562560  0.691917  0.039514  0.725394  0.829249   four
4  0.670200  0.555227  0.986620  0.494989  0.323637   five

In [18]:
df2[df2['E'].isin(['two', 'five'])]

          0         B         2         3         4     E
1  0.210793  0.194477  0.851307  0.978129  0.093404   two
4  0.670200  0.555227  0.986620  0.494989  0.323637  five

In [19]:
# 赋值
# 用索引自动对齐新增列的数据
s1 = pd.Series([-1, -2, 2, 3, 4], index=np.arange(len(data_df)))
df2['F'] = s1
df2

          0         B         2         3         4      E  F
0  0.850338  0.827350  0.761072  0.172138  0.154913    one -1
1  0.210793  0.194477  0.851307  0.978129  0.093404    two -2
2  0.786064  0.660980  0.126670  0.420458  0.061129  three  2
3  0.562560  0.691917  0.039514  0.725394  0.829249   four  3
4  0.670200  0.555227  0.986620  0.494989  0.323637   five  4

In [20]:
# 按标签赋值
df2.at[0, 'B'] = 1
df2

          0         B         2         3         4      E  F
0  0.850338  1.000000  0.761072  0.172138  0.154913    one -1
1  0.210793  0.194477  0.851307  0.978129  0.093404    two -2
2  0.786064  0.660980  0.126670  0.420458  0.061129  three  2
3  0.562560  0.691917  0.039514  0.725394  0.829249   four  3
4  0.670200  0.555227  0.986620  0.494989  0.323637   five  4

In [21]:
# 按位置赋值
df2.iat[0, 0] =1
df2

          0         B         2         3         4      E  F
0  1.000000  1.000000  0.761072  0.172138  0.154913    one -1
1  0.210793  0.194477  0.851307  0.978129  0.093404    two -2
2  0.786064  0.660980  0.126670  0.420458  0.061129  three  2
3  0.562560  0.691917  0.039514  0.725394  0.829249   four  3
4  0.670200  0.555227  0.986620  0.494989  0.323637   five  4

In [22]:
# 按numpy赋值
df2.loc[:, 'E'] = np.array([4] * len(df2))
df2

          0         B         2         3         4  E  F
0  1.000000  1.000000  0.761072  0.172138  0.154913  4 -1
1  0.210793  0.194477  0.851307  0.978129  0.093404  4 -2
2  0.786064  0.660980  0.126670  0.420458  0.061129  4  2
3  0.562560  0.691917  0.039514  0.725394  0.829249  4  3
4  0.670200  0.555227  0.986620  0.494989  0.323637  4  4

In [23]:
# 用where 条件赋值

In [24]:
df3 = df2.copy()
df3[df3>0] = -df2
df3

          0         B         2         3         4  E  F
0 -1.000000 -1.000000 -0.761072 -0.172138 -0.154913 -4 -1
1 -0.210793 -0.194477 -0.851307 -0.978129 -0.093404 -4 -2
2 -0.786064 -0.660980 -0.126670 -0.420458 -0.061129 -4 -2
3 -0.562560 -0.691917 -0.039514 -0.725394 -0.829249 -4 -3
4 -0.670200 -0.555227 -0.986620 -0.494989 -0.323637 -4 -4

In [25]:
### 运算
# 列统计
df2.mean()

0    0.645924
B    0.620520
2    0.553037
3    0.558222
4    0.292466
E    4.000000
F    1.200000
dtype: float64

In [26]:
# 行统计
df2.mean(1)

0    0.869732
1    0.618301
2    1.150757
3    1.406948
4    1.575810
dtype: float64

In [27]:
### apply 函数
# 使用numpy cumsum函数 行累加
df2.apply(np.cumsum)

          0         B         2         3         4   E  F
0  1.000000  1.000000  0.761072  0.172138  0.154913   4 -1
1  1.210793  1.194477  1.612379  1.150267  0.248316   8 -3
2  1.996857  1.855457  1.739049  1.570724  0.309446  12 -1
3  2.559418  2.547374  1.778563  2.296119  1.138695  16  2
4  3.229618  3.102601  2.765183  2.791108  1.462331  20  6

In [28]:
# 使用numpy cumsum函数 列累加
df2.apply(np.cumsum, axis=1)

          0         B         2         3         4         E          F
0  1.000000  2.000000  2.761072  2.933210  3.088122  7.088122   6.088122
1  0.210793  0.405270  1.256578  2.234707  2.328110  6.328110   4.328110
2  0.786064  1.447044  1.573714  1.994172  2.055301  6.055301   8.055301
3  0.562560  1.254477  1.293991  2.019385  2.848634  6.848634   9.848634
4  0.670200  1.225427  2.212047  2.707036  3.030673  7.030673  11.030673

In [29]:
### 直方图
df2['E'].value_counts()

4    5
Name: E, dtype: int64

In [42]:
### String methods
s = pd.Series(["A", "   B", " C ", " Aaba  ", "Baca  ", np.nan, "  CABA", "dog ", "  cat  "])

In [43]:
# str.lower 小写
s.str.lower()

0          a
1          b
2         c
3     aaba
4     baca
5        NaN
6       caba
7       dog
8      cat
dtype: object

In [44]:
# str.upper 大写
s.str.upper()

0          A
1          B
2         C
3     AABA
4     BACA
5        NaN
6       CABA
7       DOG
8      CAT
dtype: object

In [45]:
# str.len 长度
s.str.len()

0    1.0
1    4.0
2    3.0
3    7.0
4    6.0
5    NaN
6    6.0
7    4.0
8    7.0
dtype: float64

In [46]:
# str.strip 去字符串前后空格
s.str.strip()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [47]:
# str.lstrip
s.str.lstrip()

0         A
1         B
2        C
3    Aaba
4    Baca
5       NaN
6      CABA
7      dog
8     cat
dtype: object

In [48]:
# str.rstrip
s.str.rstrip()

0         A
1         B
2         C
3      Aaba
4      Baca
5       NaN
6      CABA
7       dog
8       cat
dtype: object

In [51]:
### 合并 merge
# 结合 concat
df = pd.DataFrame(np.random.randn(10, 4))
df1 = df[:3]
df2 = df[3:7]
df3 = df[7:]
df

          0         1         2         3
0 -0.984479 -0.768828 -0.422254  0.376280
1  1.180189  0.764177 -1.369984  0.001906
2  0.506003  0.338982 -1.506230 -1.083128
3  0.285933  2.311890 -0.348407 -0.826455
4 -0.047875  1.448443  1.288866 -0.590317
5 -0.110149  0.343473 -0.123795  0.582544
6 -2.608231  0.065026 -0.589577  0.465944
7 -0.671572  0.510191 -0.361500  0.048771
8  1.461228 -0.721399 -0.625669 -1.252589
9  2.576888 -0.518297 -1.000757 -1.162009

In [52]:
df1

          0         1         2         3
0 -0.984479 -0.768828 -0.422254  0.376280
1  1.180189  0.764177 -1.369984  0.001906
2  0.506003  0.338982 -1.506230 -1.083128

In [53]:
df2

          0         1         2         3
3  0.285933  2.311890 -0.348407 -0.826455
4 -0.047875  1.448443  1.288866 -0.590317
5 -0.110149  0.343473 -0.123795  0.582544
6 -2.608231  0.065026 -0.589577  0.465944

In [54]:
df3

          0         1         2         3
7 -0.671572  0.510191 -0.361500  0.048771
8  1.461228 -0.721399 -0.625669 -1.252589
9  2.576888 -0.518297 -1.000757 -1.162009

In [55]:
frames = [df1, df2, df3]
pd.concat(frames)

          0         1         2         3
0 -0.984479 -0.768828 -0.422254  0.376280
1  1.180189  0.764177 -1.369984  0.001906
2  0.506003  0.338982 -1.506230 -1.083128
3  0.285933  2.311890 -0.348407 -0.826455
4 -0.047875  1.448443  1.288866 -0.590317
5 -0.110149  0.343473 -0.123795  0.582544
6 -2.608231  0.065026 -0.589577  0.465944
7 -0.671572  0.510191 -0.361500  0.048771
8  1.461228 -0.721399 -0.625669 -1.252589
9  2.576888 -0.518297 -1.000757 -1.162009

In [57]:
### 分组 grouping   【分割】【应用】【组合】
df = pd.DataFrame({
    'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
    'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
    'C': np.random.randn(8),
    'D': np.random.randn(8)
})
df

     A      B         C         D
0  foo    one -0.401232  0.271865
1  bar    one  0.698431  1.338005
2  foo    two -0.708902  2.145404
3  bar  three  0.082743 -1.170402
4  foo    two -1.427212  0.646487
5  bar    two  1.356363  0.201892
6  foo    one  0.311519  0.052942
7  foo  three  1.243763  2.212839

In [58]:
df.groupby('A').sum()

            C         D
A
bar  2.137537  0.369495
foo -0.982063  5.329537

In [59]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.698431  1.338005
    three  0.082743 -1.170402
    two    1.356363  0.201892
foo one   -0.089712  0.324807
    three  1.243763  2.212839
    two   -2.136114  2.791891

In [60]:
df.groupby('A', sort=False).sum()

            C         D
A
foo -0.982063  5.329537
bar  2.137537  0.369495

In [61]:
# group sort
df.groupby('A', sort=True).sum()

            C         D
A
bar  2.137537  0.369495
foo -0.982063  5.329537

In [65]:
# get group
df.groupby(['A']).get_group('foo')

     A      B         C         D
0  foo    one -0.401232  0.271865
2  foo    two -0.708902  2.145404
4  foo    two -1.427212  0.646487
6  foo    one  0.311519  0.052942
7  foo  three  1.243763  2.212839

In [70]:
### 重塑 reshaping

In [68]:
### 数据透视表 pivot tables
df = pd.DataFrame({
    'A': ['one', 'one', 'two', 'three'] * 3,
    'B': ['A', 'B', 'C'] * 4,
    'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
    'D': np.random.randn(12),
    'E': np.random.randn(12)
})
df

        A  B    C         D         E
0     one  A  foo  0.529080 -0.908042
1     one  B  foo -0.612625  0.094620
2     two  C  foo -0.343495  0.101766
3   three  A  bar  0.628813 -0.304044
4     one  B  bar  0.428206  0.884788
5     one  C  bar -0.726080  1.093935
6     two  A  foo -0.610213 -1.278978
7   three  B  foo -1.666487 -1.207143
8     one  C  foo -1.013970 -0.938535
9     one  A  bar  2.116674 -1.712389
10    two  B  bar  1.245916 -0.108622
11  three  C  bar  0.377103 -1.375321

In [69]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  2.116674  0.529080
      B  0.428206 -0.612625
      C -0.726080 -1.013970
three A  0.628813       NaN
      B       NaN -1.666487
      C  0.377103       NaN
two   A       NaN -0.610213
      B  1.245916       NaN
      C       NaN -0.343495

In [73]:
### reshaping
# stack
tuples = list(zip(
    *[['bar', 'bar', 'baz', 'baz','foo', 'foo', 'qux', 'qux'],
      ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']])
             )
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -0.676922  0.127904
      two     0.754914  2.227512
baz   one     0.485387  0.214646
      two    -0.851548  0.435578
foo   one     0.122791 -1.048637
      two     0.004868  1.351619
qux   one     0.632977  0.516880
      two    -0.436722  0.621636

In [74]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [83]:
data = np.random.randn(10)
df = pd.Series(data, index=np.arange(len(data)))
df

0   -1.061059
1   -1.530383
2   -0.951615
3    0.108812
4   -1.790537
5    1.759991
6   -1.693241
7   -1.598324
8   -0.836053
9   -0.677303
dtype: float64

In [78]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [84]:
d = {'b': 1, 'a': 0, 'c': 2}
df = pd.Series(d)
df

b    1
a    0
c    2
dtype: int64

In [86]:
df['b']

1